## Table of Content
- [1. Installation of Pandas](#p1)
- [2. Data Structure](#p2)
    - [2.1 Series](#p2.1)
    - [2.2 DataFrame](#p2.2)
- [3. Pandas Functions: Reading Data](#p3)
    - [3.1 Reading CSVs - different parameters](#p3.1)
    - [3.2 Reading Excel - Using functions while reading](#p3.2)
- [4. Data Structure](#p4)
    - [4.1 Basic Functions : head/tail/Mean/Max/ Min](#p4.1)
    - [4.2 Accessing Elements in Pandas DataFrame](#p4.2)
    - [4.3 Converting type of columns](#p4.4)
- [5. Pandas Functions: Writing Data](#p5)
    - [5.1 Writing DataFrame to Excel in different Sheet](#p5.1)
    - [5.2 Writing to CSV](#p5.2)
- [6. Pandas Functions: Data Manipulation](#p6)
    - [6.1 Replacing missing values](#p6.1)
    - [6.2 Handle missing dates, empty temperature, event etc](#p6.2)
    - [6.3 Merge/Join & Concetenate DataFrames](#p6.3)
    - [6.4 GroupBy](#p6.4)

Pandas is a software library written for the Python programming language for data manipulation and analysis. 
In particular, it offers data structures and operations for manipulating numerical tables and time series. 
It is free software released under the three-clause BSD license.

The development of Pandas introduced into Python many comparable features of working with DataFrames that were established in the R programming language. The library is built upon another library, NumPy.

Refer Wikipedia - https://en.wikipedia.org/wiki/Pandas_(software)

Pandas consists of the following elements:
* A set of labeled array data structures, the primary of which are
Series and DataFrame.
* Index objects enabling both simple axis indexing and multi-level Hierarchical axis indexing.
* An integrated group by engine for aggregating and transforming data sets.
* Date range generation (date_range) and custom date offsets enabling the implementation of customized frequencies
* Input/Output tools: loading tabular data from flat files (CSV, delimited, Excel 2003), and saving and loading pandas objects from the fast and efficient PyTables/HDF5 format.
* Memory-efficient “sparse” versions of the standard data structures for storing data that is mostly missing or mostly constant (some fixed value). 
* Moving window statistics (rolling mean, rolling standard deviation, etc.)

## 1. Installation of Pandas <a id='p1' />

The easiest way to install pandas is to install it as part of the Anaconda distribution, a cross platform distribution for data analysis and scientific computing. This is the recommended installation method for most users.

Or directly install it using command:
!pip install pandas

## 2. Data structure

- Primary data structure of pandas
    * Series (1-dimensional) — It is one-dimensional labelled array capable of holding any data type 
        - The basic method to create a Series is to call: 
    
        `dataFrame = pandas.Series(data= d, index=index)`

    * DataFrame (2-dimensional) — It is a 2-dimensional labelled data structure with columns of potentially different types capable of holding 
        - The basic method to create a DataFrame is to call: 

        `dataFrame = pandas.DataFrame(data = d, index = index)`

###### Standard way to import pandas

In [1]:
import pandas as pd

C:\Users\user\anaconda3\lib\site-packages\numpy\_distributor_init.py:30: UserWarning: loaded more than 1 DLL from .libs:
C:\Users\user\anaconda3\lib\site-packages\numpy\.libs\libopenblas.EL2C6PLE4ZYW3ECEVIV3OXXGRN2NRFM2.gfortran-win_amd64.dll
C:\Users\user\anaconda3\lib\site-packages\numpy\.libs\libopenblas64__v0.3.21-gcc_10_3_0.dll
  warnings.warn("loaded more than 1 DLL from .libs:"

### 2.1 Series <a id='p2.1' />
Series is a one-dimensional labeled array capable of holding any data type (integers, strings, floating point numbers, Python objects, etc.). The axis labels are collectively referred to as the index. The basic method to create a Series is to call:

`>>> s = pd.Series(data, index=index)`

Here, data can be many different things:

- a Python dict
- an ndarray
- a scalar value (like 5)

The passed index is a list of axis labels.

\* More reference in the External Link Library

In [2]:
series = pd.Series(list('98765'))
series

0    9
1    8
2    7
3    6
4    5
dtype: object

##### Traversing Series

In [3]:
series = pd.Series([9, 8, 7, 6], index=['*', '**', '***', '****'])
series['****']

6

In [4]:
series = pd.Series(range(5), index = list('xyzxy'))
series

x    0
y    1
z    2
x    3
y    4
dtype: int64

In [5]:
series['x']

x    0
x    3
dtype: int64

##### Incomplete data in the series
* data can be filtered using conditions
* pandas can accommodate incomplete data.Incomplete data is replaced with 'NaN' and 'Nan' value is not an issue in arithmetic operations. unlike numpy ndarray, data is automatically aligned

In [6]:
series = pd.Series({1:10, 2:20, 3:30}, index=[1,2,3,4])
series

1    10.0
2    20.0
3    30.0
4     NaN
dtype: float64

In [7]:
series*4

1     40.0
2     80.0
3    120.0
4      NaN
dtype: float64

### 2.2 Dataframe <a id='p2.2' />
* Spreadsheet-like data structure containing an ordered collection of columns. 
* Has both row and column index. 

\* More reference in the External Link Library

##### Creating DataFrame using data. Further section below teach us how to read data from CSV/Excel

In [8]:
data = {
    'Country': ['US' , 'US', 'INDIA', 'INDIA'],
    'Year' : [2012,2013,2012,2013],
    'Population': [20,27,30,35]
}

In [9]:
dataFrame = pd.DataFrame(data)
dataFrame

  Country  Year  Population
0      US  2012          20
1      US  2013          27
2   INDIA  2012          30
3   INDIA  2013          35

In [10]:
dataFrame['newCol'] = dataFrame['Population'] * 2

## 3. Pandas Functions: Reading Data <a id='p3' />

### 3.1 Reading CSVs - different parameters <a id='p3.1' />

In [11]:
import pandas as pd
df = pd.read_csv('./data/stock_data.csv',header=1) #this will say my header is located at row1
print(df)
print("-----------"*10)

  GOOGLE   27.82   87   845     larry page
0    WMT    4.61  484    65           n.a.
1   MSFT   -1.00   85    64     bill gates
2    RIL  100.00   50  1023  mukesh ambani
3   TATA    5.60   -1   120     ratan tata
--------------------------------------------------------------------------------------------------------------

In [12]:
df1 = pd.read_csv('./data/stock_data_without_header.csv',header=None) #Will genrate default number headers
print(df1)
print("-----------"*10)

        0              1    2     3              4
0  GOOGLE          27.82   87   845     larry page
1     WMT           4.61  484    65           n.a.
2    MSFT             -1   85    64     bill gates
3     RIL  not available   50  1023  mukesh ambani
4    TATA            5.6   -1  n.a.     ratan tata
--------------------------------------------------------------------------------------------------------------

In [13]:
df3 = pd.read_csv('./data/stock_data_without_header.csv',header=None, names = ["ticker","eps","revenue","price","people"])
print(df3)
print("-----------"*10)

   ticker            eps  revenue price         people
0  GOOGLE          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3     RIL  not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata
--------------------------------------------------------------------------------------------------------------

In [14]:
df4 = pd.read_csv('./data/stock_data.csv',nrows=3,header=1)
print(df4)
print("-----------"*10)

  GOOGLE   27.82   87   845     larry page
0    WMT    4.61  484    65           n.a.
1   MSFT   -1.00   85    64     bill gates
2    RIL  100.00   50  1023  mukesh ambani
--------------------------------------------------------------------------------------------------------------

In [15]:
df = pd.read_csv('./data/stock_data.csv',header=1,na_values=["not available","n.a."]) #na_values will replace the specified values with NaN
print(df)
print("-----------"*10)

  GOOGLE   27.82   87   845     larry page
0    WMT    4.61  484    65            NaN
1   MSFT   -1.00   85    64     bill gates
2    RIL  100.00   50  1023  mukesh ambani
3   TATA    5.60   -1   120     ratan tata
--------------------------------------------------------------------------------------------------------------

In [16]:
# Replace not available & n.a. to NaN(Data munging/cleaning)
df = pd.read_csv('./data/stock_data.csv',header=1,na_values=["not available","n.a.",-1]) #but this will convert eps value also to NaN
print(df)
print("-----------"*10)

  GOOGLE   27.82     87   845     larry page
0    WMT    4.61  484.0    65            NaN
1   MSFT     NaN   85.0    64     bill gates
2    RIL  100.00   50.0  1023  mukesh ambani
3   TATA    5.60    NaN   120     ratan tata
--------------------------------------------------------------------------------------------------------------

In [17]:
# Convert revenue -1 to NaN
df = pd.read_csv('./data/stock_data.csv',header=1,na_values={
        'eps':["not available","n.a."],
        'revenue':["not available","n.a.",-1],
        'people':["not available","n.a."],
        'price':["not available","n.a."]
    }) 
print(df)

  GOOGLE   27.82   87   845     larry page
0    WMT    4.61  484    65           n.a.
1   MSFT   -1.00   85    64     bill gates
2    RIL  100.00   50  1023  mukesh ambani
3   TATA    5.60   -1   120     ratan tata

### 3.2 Reading Excel - Using functions while reading <a id='p3.2' />

In [18]:
import pandas as pd
df = pd.read_excel('./data/stock_data.xlsx',"Sheet1", header=1)
df

  GOOGLE   27.82   87   845     larry page
0    WMT    4.61  484    65           n.a.
1   MSFT   -1.00   85    64     bill gates
2    RIL  100.00   50  1023  mukesh ambani
3   TATA    5.60   -1   120     ratan tata

#### Using function while reading: 
##### Below function changes "people" column while reading the dataset

In [19]:
def convert_people_cell(cell):
    if cell=="n.a.":
        return 'mr Pandas'
    return cell

def convert_eps_cell(cell):
    if cell=="not available":
        return None
    return cell

In [20]:
df = pd.read_excel('./data/stock_data.xlsx',"Sheet1",converters = {
        'people': convert_people_cell,
        'eps': convert_eps_cell
    })
df

  tickers     eps  revenue  price         people
0  GOOGLE   27.82       87    845     larry page
1     WMT    4.61      484     65      mr Pandas
2    MSFT   -1.00       85     64     bill gates
3     RIL  100.00       50   1023  mukesh ambani
4    TATA    5.60       -1    120     ratan tata

## 4. Pandas Functions:

### 4.1 Basic Functions : head/tail/Mean/Max/ Min <a id='p4.1' />

* __head()__ function lists the first 5 rows as default. If we want to display first n rows. Use . 
```python
data.head(2) 
```

* __head()__ function can be applied on columns also. 
```python
data.ID.head(2)
```

*To view a small sample of a Series or DataFrame object, use the head() and tail() methods. The default number of elements to display is five, but you may pass a custom number*

* We can use other functions like tail(), max(), min(), std(), mean() etc. 
```python
data.ID.max() 
```

#### 4.1.1 Collecting basic information about data

In [21]:
data = pd.read_csv('./data/stock_data.csv')

In [22]:
#Amount of Rows and Columns
data.shape

(5, 5)

In [23]:
#Index Description
data.index

RangeIndex(start=0, stop=5, step=1)

In [24]:
#Columns in the DataFrame
data.columns

Index(['tickers', 'eps', 'revenue', 'price', 'people'], dtype='object')

In [25]:
#Non-null data counts
data.count()

tickers    5
eps        5
revenue    5
price      5
people     5
dtype: int64

In [26]:
#Creating a new column in a DataFrame
data['New Column'] = 999

In [27]:
print(data.head())
data.tail()

  tickers     eps  revenue  price         people  New Column
0  GOOGLE   27.82       87    845     larry page         999
1     WMT    4.61      484     65           n.a.         999
2    MSFT   -1.00       85     64     bill gates         999
3     RIL  100.00       50   1023  mukesh ambani         999
4    TATA    5.60       -1    120     ratan tata         999

  tickers     eps  revenue  price         people  New Column
0  GOOGLE   27.82       87    845     larry page         999
1     WMT    4.61      484     65           n.a.         999
2    MSFT   -1.00       85     64     bill gates         999
3     RIL  100.00       50   1023  mukesh ambani         999
4    TATA    5.60       -1    120     ratan tata         999

#### 4.1.2. Transposing the data

In [28]:
data.T.head()

                  0     1           2              3           4
tickers      GOOGLE   WMT        MSFT            RIL        TATA
eps           27.82  4.61        -1.0          100.0         5.6
revenue          87   484          85             50          -1
price           845    65          64           1023         120
people   larry page  n.a.  bill gates  mukesh ambani  ratan tata

#### 4.1.3  SUM 
*__will sum all numeric columns of dataframe giving sum of each columns and aggregate string for string columns __*

In [29]:
data.sum()

tickers                                  GOOGLEWMTMSFTRILTATA
eps                                                    137.03
revenue                                                   705
price                                                    2117
people        larry pagen.a.bill gatesmukesh ambaniratan tata
New Column                                               4995
dtype: object

#### 4.1.4  Mean 
*__.mean() will average all numeric columns of dataframe giving mean of each columns __*

In [30]:
data.mean()

eps            27.406
revenue       141.000
price         423.400
New Column    999.000
dtype: float64

#### 4.1.5  Describe 
*__ .describe() will give summary of all numeric columns of dataframe __*

*__ use .describe(include = ['O']) for summary of all categorical columns __*

In [31]:
data.describe()

             eps     revenue        price  New Column
count    5.00000    5.000000     5.000000         5.0
mean    27.40600  141.000000   423.400000       999.0
std     42.04795  195.029485   470.886717         0.0
min     -1.00000   -1.000000    64.000000       999.0
25%      4.61000   50.000000    65.000000       999.0
50%      5.60000   85.000000   120.000000       999.0
75%     27.82000   87.000000   845.000000       999.0
max    100.00000  484.000000  1023.000000       999.0

In [32]:
data.describe(include = ['O'])

       tickers people
count        5      5
unique       5      5
top       TATA   n.a.
freq         1      1

#### 4.1.6  Other Common Operations: mean/median/min/max/ sorting/inplace/ apply
*__Common operations:__*

In [33]:
#Sum of values in a DataFrame
data.sum()

tickers                                  GOOGLEWMTMSFTRILTATA
eps                                                    137.03
revenue                                                   705
price                                                    2117
people        larry pagen.a.bill gatesmukesh ambaniratan tata
New Column                                               4995
dtype: object

In [34]:
#Lowest value of a DataFrame
data.min()

tickers           GOOGLE
eps                 -1.0
revenue               -1
price                 64
people        bill gates
New Column           999
dtype: object

In [35]:
#Highest value
data.max()

tickers              WMT
eps                100.0
revenue              484
price               1023
people        ratan tata
New Column           999
dtype: object

In [36]:
#Statistical summary of the DataFrame, with quartiles, median, etc.
data.describe()

             eps     revenue        price  New Column
count    5.00000    5.000000     5.000000         5.0
mean    27.40600  141.000000   423.400000       999.0
std     42.04795  195.029485   470.886717         0.0
min     -1.00000   -1.000000    64.000000       999.0
25%      4.61000   50.000000    65.000000       999.0
50%      5.60000   85.000000   120.000000       999.0
75%     27.82000   87.000000   845.000000       999.0
max    100.00000  484.000000  1023.000000       999.0

In [37]:
#Average values
data.mean()

eps            27.406
revenue       141.000
price         423.400
New Column    999.000
dtype: float64

In [38]:
#Median values
data.median()

eps             5.6
revenue        85.0
price         120.0
New Column    999.0
dtype: float64

###### sorting

In [39]:
data.sort_values(by='eps', ascending = False)

  tickers     eps  revenue  price         people  New Column
3     RIL  100.00       50   1023  mukesh ambani         999
0  GOOGLE   27.82       87    845     larry page         999
4    TATA    5.60       -1    120     ratan tata         999
1     WMT    4.61      484     65           n.a.         999
2    MSFT   -1.00       85     64     bill gates         999

###### inplace will modify the original dataframe and returns none; you don't have to assign it to new dataframe

In [40]:
# Original dataframe modified and nothing returned
data.sort_values(by='eps', ascending = False, inplace=True)

###### Apply functions to data

In [41]:
data.head()

  tickers     eps  revenue  price         people  New Column
3     RIL  100.00       50   1023  mukesh ambani         999
0  GOOGLE   27.82       87    845     larry page         999
4    TATA    5.60       -1    120     ratan tata         999
1     WMT    4.61      484     65           n.a.         999
2    MSFT   -1.00       85     64     bill gates         999

In [42]:
import numpy as np
data['eps'].apply(np.cumsum)

3    [100.0]
0    [27.82]
4      [5.6]
1     [4.61]
2     [-1.0]
Name: eps, dtype: object

#### 4.1.7 Columns can be accessed in two ways 
* The first is using the DataFrame like a dictionary with string keys. Multiple columns can be accessed by passing multiple column names. 
```python
data["Open"]
```
* The second way to access columns is using the dot syntax. This only works if your column name could also be a Python variable name (i.e., no spaces), and if it doesn't collide with another DataFrame property or function name (e.g., count, sum)
```python
`data.Open `
```

In [43]:
data['eps'].head()

3    100.00
0     27.82
4      5.60
1      4.61
2     -1.00
Name: eps, dtype: float64

In [44]:
data.eps.head()

3    100.00
0     27.82
4      5.60
1      4.61
2     -1.00
Name: eps, dtype: float64

### 4.2 Accessing Elements in Pandas DataFrame <a id='p4.2' />

__Object Type	-> Indexers__
    * Series	       s.loc[indexer]
    * DataFrame	    df.loc[row_indexer,column_indexer]
    * Panel	        p.loc[item_indexer,major_indexer,minor_indexer]

__There’s three main options to achieve the selection and indexing activities in Pandas, which can be confusing. The three selection cases and methods covered in this post are:__

* Selecting data by row numbers (.iloc)
* Selecting data by label or by a conditional statment (.loc)

##### Selecting data by row numbers (.iloc)

In [45]:
data.iloc[0] # first row of data frame - Note a Series data type output.
data.iloc[1] # second row of data frame 
data.iloc[-1] # last row of data frame 
# Columns:
# data.iloc[:,0] # first column of data frame 
# data.iloc[:,1] # second column of data frame 
# data.iloc[:,-1] # last column of data frame

tickers             MSFT
eps                 -1.0
revenue               85
price                 64
people        bill gates
New Column           999
Name: 2, dtype: object

In [46]:
# Access 1st row in the dataframe
data.iloc[1]

tickers           GOOGLE
eps                27.82
revenue               87
price                845
people        larry page
New Column           999
Name: 0, dtype: object

In [47]:
# slice indexing
data.iloc[1:5,:]

  tickers    eps  revenue  price      people  New Column
0  GOOGLE  27.82       87    845  larry page         999
4    TATA   5.60       -1    120  ratan tata         999
1     WMT   4.61      484     65        n.a.         999
2    MSFT  -1.00       85     64  bill gates         999

##### Selecting data by labels (.loc)

In [48]:
data.loc[1:4,'eps']

Series([], Name: eps, dtype: float64)

In [49]:
# Select rows with index values 1 & 4, with all columns between 'eps' and 'New Column'
data.loc[[1,4], 'eps':'New Column']

    eps  revenue  price      people  New Column
1  4.61      484     65        n.a.         999
4  5.60       -1    120  ratan tata         999

In [50]:
# Select same rows, with just SKU, Vendor Nbr and Active Vendor columns
data.loc[[1,4], ['eps', 'revenue', 'people']]

    eps  revenue      people
1  4.61      484        n.a.
4  5.60       -1  ratan tata

##### Boolean Indexing

In [51]:
data.loc[data['eps'] == 100]

  tickers    eps  revenue  price         people  New Column
3     RIL  100.0       50   1023  mukesh ambani         999

### 4.3 Converting type of columns

In [52]:
data.head()

  tickers     eps  revenue  price         people  New Column
3     RIL  100.00       50   1023  mukesh ambani         999
0  GOOGLE   27.82       87    845     larry page         999
4    TATA    5.60       -1    120     ratan tata         999
1     WMT    4.61      484     65           n.a.         999
2    MSFT   -1.00       85     64     bill gates         999

In [53]:
data.dtypes

tickers        object
eps           float64
revenue         int64
price           int64
people         object
New Column      int64
dtype: object

In [54]:
data['people'] = data['people'].astype("object")
data.dtypes

tickers        object
eps           float64
revenue         int64
price           int64
people         object
New Column      int64
dtype: object

#### Categorical vs Object in Python: 

The categorical data type is useful in the following cases:

A string variable consisting of only a few different values. Converting such a string variable to a categorical variable will save some memory, see here.
The lexical order of a variable is not the same as the logical order (“one”, “two”, “three”). By converting to a categorical and specifying an order on the categories, sorting and min/max will use the logical order instead of the lexical order, see here.
As a signal to other Python libraries that this column should be treated as a categorical variable (e.g. to use suitable statistical methods or plot types).

## 5. Pandas Functions: Writing Data

### 5.1 Writing DataFrame to Excel in different Sheet

In [55]:
df_stocks = pd.DataFrame({
    'tickers':['GOOGLE','WMT','MSFT'],
    'price':[845,65,64],
    'pe':[30.37,14,30],
    'eps':[27,4,2]
})

df_weather = pd.DataFrame({
    'day':['1/1/2017','1/2/2017','1/3/2017'],
    'temperature':[32,35,28],
    'event':['Rain','Sunny','Snow']
})

In [56]:
df_stocks.to_excel("./data/new_df_stocks.xlsx",sheet_name = "stocks")

Writing on the same excel above will lead to overwriting the excel even with different sheet_name, use ExcelWriter for storing in different sheets

In [57]:
with pd.ExcelWriter('./data/stocks_weather_combined.xlsx') as writer:
    df_stocks.to_excel(writer,sheet_name="stocks")
    df_weather.to_excel(writer,sheet_name="weather")

### 5.2 Writing to csv

In [58]:
df_stocks.to_csv('./data/df_stocks.csv')

## 6. Pandas Functions: Data Manipulation

### 6.1 Replacing missing values

In [59]:
import pandas as pd
import numpy as np
df = pd.read_csv('./data/weather_data_missing_replace.csv')
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017       -99999          7  Sunny
2  1/3/2017           28     -99999   Snow
3  1/4/2017       -99999          7      0
4  1/5/2017           32     -99999   Rain
5  1/6/2017           31          2  Sunny
6  1/6/2017           34          5      0

##### 1.1.1 Deal with these special values -99999(representing null or sparse values)

In [60]:
new_df = df.replace(-99999,np.NaN)
new_df

        day  temperature  windspeed  event
0  1/1/2017         32.0        6.0   Rain
1  1/2/2017          NaN        7.0  Sunny
2  1/3/2017         28.0        NaN   Snow
3  1/4/2017          NaN        7.0      0
4  1/5/2017         32.0        NaN   Rain
5  1/6/2017         31.0        2.0  Sunny
6  1/6/2017         34.0        5.0      0

##### 1.1.2 With 2 special nan values

In [61]:
new_df = df.replace([-99999,-88888],np.NaN)
new_df

        day  temperature  windspeed  event
0  1/1/2017         32.0        6.0   Rain
1  1/2/2017          NaN        7.0  Sunny
2  1/3/2017         28.0        NaN   Snow
3  1/4/2017          NaN        7.0      0
4  1/5/2017         32.0        NaN   Rain
5  1/6/2017         31.0        2.0  Sunny
6  1/6/2017         34.0        5.0      0

##### 1.1.2.1 Replace 0 in event with NaN but not replace 0 in windspeed.. Using dictionary in replace method

In [62]:
df = pd.read_csv('./data/weather_data_missing_replace.csv')
new_df = df.replace({
    'temperature':-99999,
    'windspeed':-88888,
    'event':'0'
},np.NaN)
new_df

        day  temperature  windspeed  event
0  1/1/2017         32.0          6   Rain
1  1/2/2017          NaN          7  Sunny
2  1/3/2017         28.0     -99999   Snow
3  1/4/2017          NaN          7    NaN
4  1/5/2017         32.0     -99999   Rain
5  1/6/2017         31.0          2  Sunny
6  1/6/2017         34.0          5    NaN

##### 1.1.3 Read weather_data_missing_replace1.csv & replace 'No Event' with 'Sunny' & -99999 & -88888 with NaN

In [63]:
df = pd.read_csv('./data/weather_data_missing_replace1.csv')

new_df1 = df.replace({
    -99999 :np.NaN,
    -88888 :np.NaN,
    'No Event': 'Sunny'
})

new_df1

        day  temperature  windspeed  event
0  1/1/2017         32.0        6.0   Rain
1  1/2/2017          NaN        7.0  Sunny
2  1/3/2017         28.0        NaN   Snow
3  1/4/2017          NaN        7.0  Sunny
4  1/5/2017         32.0        NaN   Rain
5  1/6/2017         31.0        2.0  Sunny
6  1/6/2017         34.0        5.0  Sunny

##### 1.1.4 What if your data has units?? weather_data_missing_replace2

In [64]:
df = pd.read_csv('./data/weather_data_missing_replace2.csv')
df

        day temperature windspeed     event
0  1/1/2017        32 F     6 mph      Rain
1  1/2/2017      -99999     7 mph     Sunny
2  1/3/2017          28    -99999      Snow
3  1/4/2017      -99999         7  No Event
4  1/5/2017        32 C    -99999      Rain
5  1/6/2017          31         2     Sunny
6  1/6/2017          34         5  No Event

In [65]:
# Remove the units(mph,F,C) from the data
new_df = df.replace('[A-Za-z]','',regex=True) #This will remove all alplabets basically
new_df

        day temperature windspeed event
0  1/1/2017         32         6
1  1/2/2017      -99999        7
2  1/3/2017          28    -99999
3  1/4/2017      -99999         7
4  1/5/2017         32     -99999
5  1/6/2017          31         2
6  1/6/2017          34         5

In [66]:
new_df1 = df.replace({
        'temperature': '[A-Za-z]',
        'windspeed': '[A-Za-z]'
},'',regex=True)
new_df1

        day temperature windspeed     event
0  1/1/2017         32         6       Rain
1  1/2/2017      -99999        7      Sunny
2  1/3/2017          28    -99999      Snow
3  1/4/2017      -99999         7  No Event
4  1/5/2017         32     -99999      Rain
5  1/6/2017          31         2     Sunny
6  1/6/2017          34         5  No Event

##### 1.1.5 How a change a list of values with another list of values?

In [67]:
listDF = pd.DataFrame({
        'score':['exceptional','average','good','poor','average','exceptional'],
        'student':['rob','maya','parthiv','tom','julian','erica']
})
listDF

         score  student
0  exceptional      rob
1      average     maya
2         good  parthiv
3         poor      tom
4      average   julian
5  exceptional    erica

In [68]:
newListDF = listDF.replace(['poor','average','good','exceptional'],[1,2,3,4])
newListDF

   score  student
0      4      rob
1      2     maya
2      3  parthiv
3      1      tom
4      2   julian
5      4    erica

### 1.2 Handle missing dates, empty temperature, event etc

In [69]:
import pandas as pd 
df = pd.read_csv('./data/weather_data_missing.csv')
df

         day  temperature  windspeed   event
0   1/1/2017         32.0        6.0    Rain
1   1/4/2017          NaN        9.0   Sunny
2   1/5/2017         28.0        NaN    Snow
3   1/6/2017          NaN        7.0     NaN
4   1/7/2017         32.0        NaN    Rain
5   1/8/2017          NaN        NaN   Sunny
6   1/9/2017          NaN        NaN     NaN
7  1/10/2017         34.0        8.0  Cloudy
8  1/11/2017         40.0       12.0   Sunny

In [70]:
# Parsing column as date
df = pd.read_csv('./data/weather_data_missing.csv', parse_dates=["day"], index_col= 'day')
df

            temperature  windspeed   event
day
2017-01-01         32.0        6.0    Rain
2017-01-04          NaN        9.0   Sunny
2017-01-05         28.0        NaN    Snow
2017-01-06          NaN        7.0     NaN
2017-01-07         32.0        NaN    Rain
2017-01-08          NaN        NaN   Sunny
2017-01-09          NaN        NaN     NaN
2017-01-10         34.0        8.0  Cloudy
2017-01-11         40.0       12.0   Sunny

##### 1.2.1 Replacing Nan with 0

In [71]:
new_df = df.fillna(0)
new_df

            temperature  windspeed   event
day
2017-01-01         32.0        6.0    Rain
2017-01-04          0.0        9.0   Sunny
2017-01-05         28.0        0.0    Snow
2017-01-06          0.0        7.0       0
2017-01-07         32.0        0.0    Rain
2017-01-08          0.0        0.0   Sunny
2017-01-09          0.0        0.0       0
2017-01-10         34.0        8.0  Cloudy
2017-01-11         40.0       12.0   Sunny

###### 1.2.2 Replacing few Nan  with 0

In [72]:
new_df = df.fillna({
'temperature':0,
'windspeed':0,
'event':'no event'
}) 

new_df

            temperature  windspeed     event
day
2017-01-01         32.0        6.0      Rain
2017-01-04          0.0        9.0     Sunny
2017-01-05         28.0        0.0      Snow
2017-01-06          0.0        7.0  no event
2017-01-07         32.0        0.0      Rain
2017-01-08          0.0        0.0     Sunny
2017-01-09          0.0        0.0  no event
2017-01-10         34.0        8.0    Cloudy
2017-01-11         40.0       12.0     Sunny

In [73]:
# Use back fill to fill - values by taking previous values 
new_df = df.fillna(method = "bfill")#Put next days value to NaN into NaN
new_df

            temperature  windspeed   event
day
2017-01-01         32.0        6.0    Rain
2017-01-04         28.0        9.0   Sunny
2017-01-05         28.0        7.0    Snow
2017-01-06         32.0        7.0    Rain
2017-01-07         32.0        8.0    Rain
2017-01-08         34.0        8.0   Sunny
2017-01-09         34.0        8.0  Cloudy
2017-01-10         34.0        8.0  Cloudy
2017-01-11         40.0       12.0   Sunny

In [74]:
#copy only one time in below columns to current cell
new_df = df.fillna(method = "ffill",limit=1) 
new_df

            temperature  windspeed   event
day
2017-01-01         32.0        6.0    Rain
2017-01-04         32.0        9.0   Sunny
2017-01-05         28.0        9.0    Snow
2017-01-06         28.0        7.0    Snow
2017-01-07         32.0        7.0    Rain
2017-01-08         32.0        NaN   Sunny
2017-01-09          NaN        NaN   Sunny
2017-01-10         34.0        8.0  Cloudy
2017-01-11         40.0       12.0   Sunny

##### 1.2.3 Replacing Nan with interpolation

In [75]:
new_df = df.interpolate()#Equivalent to df.interpolate(method='linear') #works on numeric data and in linear way by default(method='linear')
new_df

            temperature  windspeed   event
day
2017-01-01    32.000000       6.00    Rain
2017-01-04    30.000000       9.00   Sunny
2017-01-05    28.000000       8.00    Snow
2017-01-06    30.000000       7.00     NaN
2017-01-07    32.000000       7.25    Rain
2017-01-08    32.666667       7.50   Sunny
2017-01-09    33.333333       7.75     NaN
2017-01-10    34.000000       8.00  Cloudy
2017-01-11    40.000000      12.00   Sunny

In [76]:
new_df = df.interpolate(method ='time')
new_df

            temperature  windspeed   event
day
2017-01-01    32.000000       6.00    Rain
2017-01-04    29.000000       9.00   Sunny
2017-01-05    28.000000       8.00    Snow
2017-01-06    30.000000       7.00     NaN
2017-01-07    32.000000       7.25    Rain
2017-01-08    32.666667       7.50   Sunny
2017-01-09    33.333333       7.75     NaN
2017-01-10    34.000000       8.00  Cloudy
2017-01-11    40.000000      12.00   Sunny

##### 1.2.4 Dropping Na values

In [77]:
# Dropping all na values
new_df = df.dropna()# Default it will drop the rows having atleast one NaN
new_df

            temperature  windspeed   event
day
2017-01-01         32.0        6.0    Rain
2017-01-10         34.0        8.0  Cloudy
2017-01-11         40.0       12.0   Sunny

In [78]:
new_df = df.dropna(how ="all")
new_df

            temperature  windspeed   event
day
2017-01-01         32.0        6.0    Rain
2017-01-04          NaN        9.0   Sunny
2017-01-05         28.0        NaN    Snow
2017-01-06          NaN        7.0     NaN
2017-01-07         32.0        NaN    Rain
2017-01-08          NaN        NaN   Sunny
2017-01-10         34.0        8.0  Cloudy
2017-01-11         40.0       12.0   Sunny

In [79]:
# Keep rows with 1 or more Nan values or none Nan values -> all values 
new_df = df.dropna(thresh=1)#thresh=1 means it will check for atleast one valid value(non NaN) in a row & keep that row
new_df

            temperature  windspeed   event
day
2017-01-01         32.0        6.0    Rain
2017-01-04          NaN        9.0   Sunny
2017-01-05         28.0        NaN    Snow
2017-01-06          NaN        7.0     NaN
2017-01-07         32.0        NaN    Rain
2017-01-08          NaN        NaN   Sunny
2017-01-10         34.0        8.0  Cloudy
2017-01-11         40.0       12.0   Sunny

In [80]:
new_df = df.dropna(thresh=2)#thresh=2 means it will check for atleast two valid value(non NaN) in a row & keep that row
new_df

            temperature  windspeed   event
day
2017-01-01         32.0        6.0    Rain
2017-01-04          NaN        9.0   Sunny
2017-01-05         28.0        NaN    Snow
2017-01-07         32.0        NaN    Rain
2017-01-10         34.0        8.0  Cloudy
2017-01-11         40.0       12.0   Sunny

### 1.3 Merge/Join & Concatenate DataFrames

##### 1.3.1 Merge

In [81]:
df1 = pd.DataFrame({
   "city": ["new york","chicago","orlando","baltimore"],
    "State": ['US','US','US', 'US'],
    "temperature": [21,14,35,32]
})
df1

        city State  temperature
0   new york    US           21
1    chicago    US           14
2    orlando    US           35
3  baltimore    US           32

In [82]:
df2 = pd.DataFrame({
   "city": ["new york","orlando","chicago"],
    "State": ['US','US','US'],
    "humidity": [65,68,75]
})
df2

       city State  humidity
0  new york    US        65
1   orlando    US        68
2   chicago    US        75

In [83]:
df3 = pd.merge(df1,df2,on="city")  # inner join
df3

       city State_x  temperature State_y  humidity
0  new york      US           21      US        65
1   chicago      US           14      US        75
2   orlando      US           35      US        68

In [84]:
df3 = pd.merge(df1,df2,on="city", how="left", indicator=True, suffixes=('_left','_right')) 
df3

        city State_left  temperature State_right  humidity     _merge
0   new york         US           21          US      65.0       both
1    chicago         US           14          US      75.0       both
2    orlando         US           35          US      68.0       both
3  baltimore         US           32         NaN       NaN  left_only

##### 1.3.2 Join

In [85]:
df1.join(df2) # gives error

ValueError: columns overlap but no suffix specified: Index(['city', 'State'], dtype='object')

In [ ]:
df1.join(df2,lsuffix="_l",rsuffix="_r")

##### 1.3.3 Concat:

###### Column wise concatenation

In [ ]:
result = pd.concat([df1, df2], axis=1, sort=False)
result

###### Row-wise concatenation

In [ ]:
result = pd.concat([df1, df2], axis=0, sort=False)
result

### 1.4 Groupby

In [ ]:
df = pd.read_csv('data\weather_data_groupBy.csv')

In [ ]:
g = df.groupby('city')

In [ ]:
g.get_group('mumbai')

In [ ]:
for city, city_df in g:
    print (city)
    print (city_df)